# Loading Movies Data

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [114]:
#title_basic = ("https://datasets.imdbws.com/title.basics.tsv.gz")
#title_akas = ("https://datasets.imdbws.com/title.akas.tsv.gz")
#title_ratings = ("https://datasets.imdbws.com/title.ratings.tsv.gz")

In [70]:
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory=False)

In [71]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [72]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163958 entries, 0 to 163957
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          163958 non-null  object
 1   titleType       163958 non-null  object
 2   primaryTitle    163958 non-null  object
 3   originalTitle   163958 non-null  object
 4   isAdult         163958 non-null  int64
 5   startYear       163958 non-null  int64
 6   endYear         0 non-null       float64
 7   runtimeMinutes  163958 non-null  int64
 8   genres          163958 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 11.3+ MB

In [5]:
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory=False)

In [73]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [7]:
rating = pd.read_csv("Data/title_ratings.csv.gz", low_memory=False)

In [74]:
rating.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.9       256
4  tt0000005            6.2      2517
5  tt0000006            5.2       173
6  tt0000007            5.4       783

In [121]:
basics = basics.replace({'\\N':np.nan})

In [75]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [123]:
akas = akas.replace({'\\N':np.nan})

In [76]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [125]:
rating = rating.replace({'\\N':np.nan})

In [77]:
rating.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.9       256
4  tt0000005            6.2      2517
5  tt0000006            5.2       173
6  tt0000007            5.4       783

In [127]:
basics.dropna(subset=['runtimeMinutes'], inplace=True)

In [128]:
basics.dropna(subset=['genres'], inplace=True)

In [78]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [134]:
basics = basics.loc[basics['titleType'] == 'movie']

In [79]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [151]:
basics = basics.loc[basics['genres'] != 'Documentary']

In [80]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [165]:
basics = basics.loc[basics['startYear'].between('2000','2022', inclusive=True)]

C:\Users\jonny\AppData\Local\Temp\ipykernel_18588\1918233108.py:1: FutureWarning: Boolean inputs to the `inclusive` argument are deprecated in favour of `both` or `neither`.
  basics = basics.loc[basics['startYear'].between('2000','2022', inclusive=True)]

In [81]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [82]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [169]:
akas = akas.loc[akas['region'] == 'US']

In [84]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [85]:
keepers = basics['tconst'].isin(akas['titleId'])
keepers

0          True
1          True
2          True
3         False
4          True
          ...
163953     True
163954     True
163955    False
163956     True
163957    False
Name: tconst, Length: 163958, dtype: bool

In [86]:
basics = basics[keepers]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
7,tt0094859,movie,Chief Zabu,Chief Zabu,0,2016,NaN,74,Comedy
...,...,...,...,...,...,...,...,...,...
163950,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama
163951,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy"
163953,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
163954,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
163956,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"

In [87]:
keepers2 = rating['tconst'].isin(akas['titleId'])
keepers2

0          True
1          True
4          True
5          True
6          True
           ...
1262939    True
1262946    True
1262947    True
1262951    True
1262965    True
Name: tconst, Length: 475727, dtype: bool

In [88]:
rating = rating[keepers2]
rating

            tconst  averageRating  numVotes
0        tt0000001            5.7      1905
1        tt0000002            5.9       256
4        tt0000005            6.2      2517
5        tt0000006            5.2       173
6        tt0000007            5.4       783
...            ...            ...       ...
1262939  tt9916204            8.1       242
1262946  tt9916348            8.5        17
1262947  tt9916362            6.4      4814
1262951  tt9916428            3.8        14
1262965  tt9916720            5.1       245

[475727 rows x 3 columns]

In [106]:
#checking if 'startYear' is numeric
basics[basics['startYear'] == 2020]

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2020,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2020,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2020,NaN,100,"Comedy,Horror,Sci-Fi"
7,tt0094859,movie,Chief Zabu,Chief Zabu,0,2020,NaN,74,Comedy
...,...,...,...,...,...,...,...,...,...
163950,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2020,NaN,74,Drama
163951,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2020,NaN,97,"Comedy,Drama,Fantasy"
163953,tt9916170,movie,The Rehearsal,O Ensaio,0,2020,NaN,51,Drama
163954,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
163956,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"

In [94]:
basics.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [93]:
akas.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)

In [92]:
rating.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

In [100]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 94229 entries, 0 to 163956
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          94229 non-null  object
 1   titleType       94229 non-null  object
 2   primaryTitle    94229 non-null  object
 3   originalTitle   94229 non-null  object
 4   isAdult         94229 non-null  int64
 5   startYear       94229 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  94229 non-null  int64
 8   genres          94229 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 7.2+ MB

In [99]:
akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1342190 entries, 0 to 1342189
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1342190 non-null  object
 1   ordering         1342190 non-null  int64
 2   title            1342190 non-null  object
 3   region           1342190 non-null  object
 4   language         3676 non-null     object
 5   types            963271 non-null   object
 6   attributes       44717 non-null    object
 7   isOriginalTitle  1340815 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 81.9+ MB

In [98]:
rating.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 475727 entries, 0 to 1262965
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         475727 non-null  object
 1   averageRating  475727 non-null  float64
 2   numVotes       475727 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 14.5+ MB